      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      * システムＩＤ   : TEST
      * システム名称   : TEST
      * プログラム名称 : TEST
      * 処理概要       : 
      * 参照ＤＢ       : 
      * 引数           : 
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20061103   新規  SCS        TEST    新規作成
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    TEST.
       AUTHOR.        adams.
       DATE-WRITTEN.  06-11-03.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       L1000V.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-PGM-ID            PIC  X(04)  VALUE  "TEST".
         05  CNS-ORA-USER          PIC  X(22)
                         VALUE "UTC410/UTC410@UTSTAR".
      ******************************************************************
      *                ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05 WK-COUNT               PIC  9(02).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************     
      ******************************************************************
      *                 連絡節
      ******************************************************************
      *LINKAGE                SECTION.
      *
      ******************************************************************
      *                ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬ通信領域
           EXEC SQL INCLUDE  SQLCA             END-EXEC.
           EXEC SQL BEGIN    DECLARE SECTION   END-EXEC.
       01  ORA-WORKING-ITEMS.
      *----------  ORACLE接続メーザ領∵
         05  HST-ORA-USER          PIC  X(40).
         05  SQLSTMT               PIC  X(8000).
         05  HST-TABLE-INPUT
           10  H-IN-A              PIC  X(03).
           10  H-IN-B              PIC  X(03).
         05  HST-TABLE-OUTPUT
           10  H-OUT-A             PIC  X(03).
           10  H-OUT-B             PIC  X(03).
           EXEC  SQL  END     DECLARE  SECTION    END-EXEC.
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
       TEST-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期処理
           PERFORM  INIT-RTN
      *----------  メイン処理
           PERFORM  MAIN-RTN
      *----------  終了処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  END  ***".
      *-----------------------------------------------------------------
           CONTINUE.
       TEST-EXT.
           GOBACK.
      ******************************************************************
      *                 初期処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  WORK-AREA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  START  *****'.
      *-----------------------------------------------------------------
           MOVE  CNS-ORA-USER  TO  HST-ORA-USER.
           EXEC SQL
               CONNECT :HST-ORA-USER
           END-EXEC.
           DISPLAY  "SQLCODE="SQLCODE.
           EXEC    SQL
             DECLARE    CUR01    CURSOR    FOR
             SELECT  a
                     ,b
                     ,c
             FROM  TEMP
           END-EXEC
           EXEC    SQL
                   OPEN  CUR01
           END-EXEC.
           DISPLAY  "SQLCODE="SQLCODE.
           
           
           EXEC    SQL
                   FETCH CUR01
                   INTO
                      :HST-TABLE-OUTPUT.H-OUT-A,
                      :HST-TABLE-OUTPUT.H-OUT-B
           END-EXEC.
           DISPLAY  "SQLCODE="SQLCODE.
           
           
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *                 終了処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  START  *****'.
      *-----------------------------------------------------------------

      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
