      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      * システムＩＤ   : TEST
      * システム名称   : TEST
      * プログラム名称 : TEST
      * 処理概要       : 
      * 参照ＤＢ       : 
      * 引数           : 
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20061103   新規  SCS        TEST    新規作成
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    TEST_FILE.
       AUTHOR.        adams.
       DATE-WRITTEN.  06-11-03.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       L1000V.
       INPUT-OUTPUT           SECTION.
           FILE-CONTROL.
             SELECT  IN-TEXT  ASSIGN  TO  INFILE
             FILE  STATUS   IS    INFILE-STATUS.
             SELECT  OUT-TEXT ASSIGN  TO  OUTFILE
             FILE  STATUS   IS    OUTFILE-STATUS.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        ファイル節
      ******************************************************************
       FILE                   SECTION.
      *----------  ファイル
       FD IN-TEXT  
          LABEL RECORD IS STANDARD
                   DATA RECORD IS IN-TEXT-REC.
       01 IN-TEXT-REC.
         05  FILLER                PIC  X(20361).
       FD  OUT-TEXT
           LABEL RECORD IS STANDARD.
       01  OUT-FILE.
         05  OUT-FILE02-STRING.
           COPY "AMA9600.cpy".
         05  LINEEND2              PIC  X(01).
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-PGM-ID            PIC  X(04)  VALUE  "TEST".
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FILE-AREA.
         05  INFILE                PIC  X(251).
         05  FILE-STATUS           PIC  X(02).
       01  FLAG-AREA.
      *----< ファイルを開く判定フラグ >----*
         05  FLG-FILE-OPEN         PIC  9(02).
      ******************************************************************
      *                ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05 WK-COUNT               PIC  9(02).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************     
      ******************************************************************
      *                 連絡節
      ******************************************************************
      *LINKAGE                SECTION.
      *
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
       TEST-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期処理
           PERFORM  INIT-RTN
      *----------  メイン処理
           PERFORM  MAIN-RTN
      *----------  終了処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  END  ***".
      *-----------------------------------------------------------------
           CONTINUE.
       TEST-EXT.
           GOBACK.
      ******************************************************************
      *                 初期処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  WORK-AREA
                       FILE-AREA
           MOVE  "d:\111.txt"  TO  INFILE
           PERFORM     FILE-OPEN-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  START  *****'.
      *-----------------------------------------------------------------
           READ  IN-TEXT
             AT  END    PERFORM  INFILE-CLOSE-RTN
           END-READ
           DISPLAY  "IN-TEXT-REC:" IN-TEXT-REC.
      
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *       FILE-OPEN-RTN
      ******************************************************************
       FILE-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  FILE-OPEN-RTN  START  *****".
      *-----------------------------------------------------------------
           OPEN    INPUT   IN-TEXT
           IF  FILE-STATUS  NOT =  0  THEN
               DISPLAY "FILE OPEN ERROR !"
               STOP  RUN
           END-IF.
           MOVE  1  TO  FLG-FILE-OPEN.
      *-------------------<DEBUG>---------------------------------------*
      D    DISPLAY  "*** FILE-STATUS ***",     FILE-STATUS.
      D    DISPLAY  "*****  FILE-OPEN-RTN  END  *****".
      *------------------------------------------------------------------
       FILE-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    INFILE-CLOSE-RTN
      ******************************************************************
       INFILE-CLOSE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** INFILE-CLOSE-RTN START ***".
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN = CNS-1
           THEN
               CLOSE        IN-TEXT
               INITIALIZE   FLG-FILE-OPEN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** INFILE-CLOSE-RTN EXIT ***".
      *-----------------------------------------------------------------
       INFILE-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *                 終了処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  START  *****'.
      *-----------------------------------------------------------------

      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
