      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      * システムＩＤ   : TEST
      * システム名称   : TEST
      * プログラム名称 : TEST
      * 処理概要       : 
      * 参照ＤＢ       : 
      * 引数           : 
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20061103   新規  SCS        TEST    新規作成
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.            TEST-FILE.
       AUTHOR.                adams.
       DATE-WRITTEN.          06-11-03.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       L1000V.
       INPUT-OUTPUT           SECTION.
           FILE-CONTROL.
             SELECT  IN-FILE  ASSIGN  TO  IN-FILE-NAME
             FILE  STATUS   IS    INFILE-STATUS.
             SELECT  OUT-FILE ASSIGN  TO  OUT-FILE-NAME
             FILE  STATUS   IS    OUTFILE-STATUS.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        ファイル節
      ******************************************************************
       FILE                   SECTION.
      *----------  ファイル
       FD IN-FILE  
                 LABEL RECORD IS STANDARD
                 DATA RECORD IS IN-TEXT-REC.
       01  IN-TEXT-REC.
           03  FILLER              PIC  X(20361).
       FD  OUT-FILE
                 LABEL RECORD IS STANDARD
                 DATA RECORD IS OUT-TEXT-REC.
       01  OUT-TEXT-REC.
           03  FILLER              PIC  X(20361).
           03  LINEEND2            PIC  X(01).
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-PGM-ID            PIC  X(04)  VALUE  "TEST".
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FILE-AREA.
         05  INFILE                PIC  X(251).
         05  INFILE-STATUS         PIC  X(02).
         05  OUTFILE               PIC  X(251).
         05  OUTFILE-STATUS        PIC  X(02).
       01  FLAG-AREA.
      *----< ファイルを開く判定フラグ >----*
         05  FLG-FILE-OPEN         PIC  9(02).
      ******************************************************************
      *                ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05 WK-COUNT               PIC  9(02).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************     
      ******************************************************************
      *                 連絡節
      ******************************************************************
      *LINKAGE                SECTION.
      *
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
       TEST-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期処理
           PERFORM  INIT-RTN
      *----------  メイン処理
           PERFORM  MAIN-RTN
      *----------  終了処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  END  ***".
      *-----------------------------------------------------------------
           CONTINUE.
       TEST-EXT.
           GOBACK.
      ******************************************************************
      *                 初期処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  WORK-AREA
                       FILE-AREA
           MOVE  "111.txt"  TO  IN-FILE-NAME
           MOVE  "222.txt"  TO  OUT-FILE-NAME
           OPEN    INPUT    IN-FILE.
           OPEN    EXTEND   OUT-FILE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  START  *****'.
      *-----------------------------------------------------------------
           READ  IN-FILE
             AT  END    PERFORM  CLOSE  IN-FILE
           END-READ
           DISPLAY  "IN-TEXT-REC:" IN-TEXT-REC.
           MOVE  IN-TEXT-REC  TO  OUT-TEXT-REC
           WRITE  OUT-TEXT-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *                 終了処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  START  *****'.
      *-----------------------------------------------------------------
           CLOSE  IN-FILE
           CLOSE  OUT-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
