      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      * システムＩＤ   : TEST
      * システム名称   : TEST
      * プログラム名称 : TEST
      * 処理概要       : 
      * 参照ＤＢ       : 
      * 引数           : 
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20061103   新規  SCS        TEST    新規作成
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    TEST-SQL.
       AUTHOR.        adams.
       DATE-WRITTEN.  06-11-03.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       L1000V.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-PGM-ID            PIC  X(04)  VALUE  "TEST".
         05  CNS-ORA-USER          PIC  X(22)
                         VALUE "UTC410/UTC410@UTSTAR".
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  フラグオラクル接続
         05  FLG-ORA-CONNECT       PIC  9(01).
      *----------  ERR-RTNフラグ
         05  FLG-ERR               PIC  9(01).
      *----------  カーソル1オープンフラグ
         05  FLG-CURSOR1-OPEN      PIC  9(01).
         05  FLG-CURSOR1-EOF       PIC  9(01).
      ******************************************************************
      *                カウンタ  エリア
      ******************************************************************
       01  COUNTER-AREA.
      *----------  ワーク内訳フェッチ件数
         05  CNT-FETCH-KNS         PIC  9(09).
      ******************************************************************
      *                ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
      *----------  ワーク戻り値
         05  WK-PGM-END-STS        PIC  9(02).
         05  WK-COUNT              PIC  9(02).
      ******************************************************************
      *                ＳＱＬ文作成  エリア
      ******************************************************************
       01  SQL-TBL.
         05  SQL-SELECT.
      *----------  SELECT
           10  FILLER              PIC  X(07)  VALUE
             "SELECT ".
      *----------  A
           10  FILLER              PIC  X(03)  VALUE
             "A, ".
      *----------  B
           10  FILLER              PIC  X(02)  VALUE
             "B ".
      *----------  FROM
           10  FILLER              PIC  X(05)  VALUE
             "FROM ".
      *----------  テーブルID
           10  TBL-NAME            PIC  X(13).
      *----------  抽出条件（WHERE）
      *----------  C
           10  FILLER              PIC  X(14)  VALUE
             " WHERE C = :V1".
      *----------  D
           10  FILLER              PIC  X(08)  VALUE
             " D = :V2".
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************     
      ******************************************************************
      *                 連絡節
      ******************************************************************
      *LINKAGE                SECTION.
      *
      ******************************************************************
      *                ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬ通信領域
           EXEC SQL INCLUDE  SQLCA             END-EXEC.
           EXEC SQL BEGIN    DECLARE SECTION   END-EXEC.
       01  ORA-WORKING-ITEMS.
      *----------  ORACLE接続メーザ領∵
         05  HST-ORA-USER          PIC  X(40).
         05  SQLSTMT               PIC  X(8000).
         05  HST-TABLE-INPUT.
           10  H-IN-A              PIC  X(03).
           10  H-IN-B              PIC  X(03).
         05  HST-TABLE-OUTPUT.
           10  H-OUT-C             PIC  X(03).
           10  H-OUT-D             PIC  X(03).
           EXEC  SQL  END     DECLARE  SECTION    END-EXEC.
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
       TEST-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期処理
           PERFORM  INIT-RTN
      *----------  メイン処理
           PERFORM  MAIN-RTN
      *----------  終了処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  TEST 処理  END  ***".
      *-----------------------------------------------------------------
           CONTINUE.
       TEST-EXT.
           GOBACK.
      ******************************************************************
      *                 初期処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  FLG-AREA
                       COUNTER-AREA
                       WORK-AREA
                       SQL-TBL
                       ORA-WORKING-ITEMS
      *----------  オラクル接続
           PERFORM  ORA-CONNECT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    オラクル接続
      ******************************************************************
       ORA-CONNECT-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "*****  オラクル接続  START  *****"
      *-----------------------------------------------------------------
           MOVE  CNS-ORA-USER  TO  HST-ORA-USER.
      *----------  オラクルを接続する
           EXEC  SQL
               WHENEVER  SQLERROR  CONTINUE
           END-EXEC
      *----------  ORACLE接続フラグOFF(初期化)
           INITIALIZE  FLG-ORA-CONNECT
      *----------  ＳＱＬコードチェック
           EXEC  SQL
               CONNECT :HST-ORA-USER
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "SQLCODE OF CONNECT:[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = 0  THEN
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "オラクルを接続"
      *-----------------------------------------------------------------
      *----------  ORACLE接続フラグON(接続成功)
             MOVE  1  TO  FLG-ORA-CONNECT
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "SQL処理エラー(CONNECT)"
      *-----------------------------------------------------------------
      *----------  エラー処理
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "*****  オラクル接続  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       ORA-CONNECT-EXT.
           EXIT.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  START  *****'.
      *-----------------------------------------------------------------
      *----------  カーソル1定義
           PERFORM  CURSOR1-DECLARE-RTN
      *----------  カーソル1オープン
           PERFORM  CURSOR1-OPEN-RTN   
      *----------  カーソル1フェッチ
           PERFORM  CURSOR1-FETCH-RTN
           PERFORM  UNTIL  FLG-CURSOR1-EOF = 1
      *----------  ワークフェッチ件数をカウントする
             COMPUTE  CNT-FETCH-KNS = CNT-FETCH-KNS + 1
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "フェッチ件数:["CNT-FETCH-KNS"]"
      *-----------------------------------------------------------------
             PERFORM  CURSOR1-FETCH-RTN
           END-PERFORM         
      *----------  カーソル1クローズ
           PERFORM  CURSOR1-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  MAIN-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        カーソル1定義
      ******************************************************************
       CURSOR1-DECLARE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1定義 START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  SQL-SELECT
                       SQLSTMT
      *----------  テーブルID
           MOVE  "TABLE"
             TO  TBL-NAME               OF SQL-SELECT
           MOVE  "aaa"
             TO  H-IN-A                 OF HST-TABLE-INPUT
           MOVE  "bbb"
             TO  H-IN-B                 OF HST-TABLE-INPUT
           MOVE  SQL-SELECT  TO  SQLSTMT
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "SQL:["SQLSTMT"]"
      *-----------------------------------------------------------------
      *----------  カーソル1プレパラシオン
           EXEC SQL
             PREPARE  SEL  FROM :SQLSTMT
           END-EXEC
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "プレパラシオンSQLCODE:["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE=「0：正常終了」 の場合
           IF  SQLCODE = 0  THEN
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "プレパラシオン正常"
      *-----------------------------------------------------------------
             CONTINUE
      *----------  SQLCODE≠「0：正常終了」 の場合
           ELSE
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "プレパラシオンエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
             CONTINUE
           END-IF
      *----------  カーソル1定義
           EXEC  SQL
             DECLARE  CURSOR1  CURSOR  FOR  SEL
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1定義 END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-DECLARE-EXT.
           EXIT.
      ******************************************************************
      *        カーソル1オープン
      ******************************************************************
       CURSOR1-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1オープン START  ****"
      *-----------------------------------------------------------------
      *----------  カーソル1オープン
           EXEC    SQL
             OPEN  CURSOR1   USING  :H-IN-A,
                                    :H-IN-B
           END-EXEC.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "カーソル1オープンSQLCODE:["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE=「0：正常終了」 の場合
           IF  SQLCODE = 0  THEN
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "カーソル1オープン正常"
      *-----------------------------------------------------------------
      *----------  カーソル1オープンフラグに１をセットする
             MOVE  1  TO  FLG-CURSOR1-OPEN
      *----------  ワーク内訳フェッチ件数に0をセットする
             MOVE  ZERO  TO  CNT-FETCH-KNS
      *----------  SQLCODE≠「0：正常終了」 の場合
           ELSE
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "カーソル1オープンエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
             CONTINUE
           END-IF
      *------------------------DEBUG------------------------------------
      D    DISPLAY "カーソル1オープンフラグ:["FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1オープン END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-OPEN-EXT.
           EXIT.
      ******************************************************************
      *        カーソル1フェッチ
      ******************************************************************
       CURSOR1-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1フェッチ START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  HST-TABLE-OUTPUT
                       FLG-CURSOR1-EOF
           EXEC  SQL
             FETCH  CURSOR1
               INTO   :H-OUT-C,
                      :H-OUT-D
           END-EXEC
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "カーソル1フェッチSQLCODE:["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  SQLCODE=「0：正常終了」 の場合
             WHEN  0
      *-------------------------DEBUG-----------------------------------
      D        DISPLAY "カーソル1フェッチ正常"
      *-----------------------------------------------------------------
               DISPLAY  "C:["H-OUT-C"]"
               DISPLAY  "D:["H-OUT-D"]"
      *----------  SQLCODE＝1403 (NOTFOUND)の場合
             WHEN  1403
      *-------------------------DEBUG-----------------------------------
      D        DISPLAY "カーソル1フェッチNOTFOUND"
      *-----------------------------------------------------------------
      *----------  データフラグに1をセット
               MOVE  1  TO  FLG-CURSOR1-EOF
      *----------  上記以外の場合
             WHEN  OTHER
      *-------------------------DEBUG-----------------------------------
      D        DISPLAY "カーソル1フェッチエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
               CONTINUE
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1フェッチ END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *        カーソル1クローズ
      ******************************************************************
       CURSOR1-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1クローズ START  ****"
      *-----------------------------------------------------------------
      *----------  カーソル1クローズ
           EXEC SQL
             CLOSE  CURSOR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "カーソル1クローズSQLCODE:["
      D      SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE=「0：正常終了」 の場合
           IF  SQLCODE = 0  THEN
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "カーソル1クローズ正常"
      *-----------------------------------------------------------------
      *----------  カーソル1オープンフラグに0をセットする
             MOVE  0  TO  FLG-CURSOR1-OPEN
      *----------  SQLCODE≠「0：正常終了」 の場合
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "カーソル1クローズエラー"
      *-----------------------------------------------------------------
      *----------  基本処理中カーソル1クローズエラー
             IF  FLG-ERR  = 1  THEN
      *----------  カーソル1オープンフラグに0をセットする
               MOVE  0  TO  FLG-CURSOR1-OPEN
      *----------  エラー処理中カーソル1 CLOSEエラー
             ELSE
      *----------  カーソル1オープンフラグに0をセットする
               MOVE  0  TO  FLG-CURSOR1-OPEN
      *----------  エラー処理
             END-IF
           END-IF
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "カーソル1 オープンフラグ:["FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "****  カーソル1クローズ END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *                 終了処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  START  *****'.
      *-----------------------------------------------------------------
      *----------  ＤＢ コミット リリース
           EXEC SQL
               COMMIT RELEASE
           END-EXEC
           IF  SQLCODE = 0  THEN
      *----------  ORACLE接続フラグOFF(切断)
             MOVE  0  TO  FLG-ORA-CONNECT
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D      DISPLAY "SQL処理エラー（COMMIT)"
      *-----------------------------------------------------------------
      *----------  エラー処理
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  '*****  END-RTN  END  *****'.
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "<<  エラー処理  START  >>"
      *-----------------------------------------------------------------
      *----------  エラー処理フラグをセット
           MOVE  1  TO  FLG-ERR
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY "FLG-CURSOR1-OPEN :["FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
      *----------  カーソル1オープンフラグが1の場合
           IF  FLG-CURSOR1-OPEN = 1  THEN
      *----------  カーソル1クローズ
             PERFORM  CURSOR1-CLOSE-RTN
           END-IF
      D    DISPLAY "FLG-ORA-CONNECT:["FLG-ORA-CONNECT"]"
      *----------  ORACLE接続フラグONの場合
           IF  FLG-ORA-CONNECT = 1  THEN
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "ＤＢ接続している場合(データ  ROLLBACK RELEASE)"
      *-----------------------------------------------------------------
      *----------  ロールバック処理、オラクルを切断する
             EXEC SQL
               ROLLBACK  RELEASE
             END-EXEC
      *----------  ORACLE接続フラグOFF(切断)
             MOVE  0  TO  FLG-ORA-CONNECT
      *----------  ORACLE接続フラグOFFの場合
           ELSE
      *-------------------------DEBUG-----------------------------------
      D      DISPLAY "ＤＢ接続しないの場合(CONTINUE)"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  件数
           MOVE  ZERO  TO  CNT-FETCH-KNS
      *----------  プログラム異常終了(異常：16)
           MOVE  16  TO  WK-PGM-END-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "<<  エラー処理  END  >>"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN WK-PGM-END-STS.

